app/controllers/users_controller.rb

INSERT INTO "users" ("username", "email", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "Testes"], ["email", "testes@gmail.com"], ["password", "testes123"], ["created_at", "2021-12-01 19:01:46.946177"], ["updated_at", "2021-12-01 19:01:46.946177"]]
---
  def create
    @user = User.new(user_params)

    if @user.save